#### Terraform Plan

<details><summary>Show Plan</summary>

```
aws_s3_bucket.cloudWebsite_WebsiteBucket_EB03D355: Refreshing state... [id=cloud-website-c8e58765-20230803215115368500000001]
aws_iam_role.VotingAppApi_VotingAppApi-OnRequest-8d2e75ec_IamRole_0FF833EF: Refreshing state... [id=terraform-20230803215115569800000002]
data.aws_region.Region: Reading...
aws_iam_role.VotingAppApi_VotingAppApi-OnRequest-41f14472_IamRole_5F3056C5: Refreshing state... [id=terraform-20230727204725916100000001]
aws_iam_role.VotingAppApi_VotingAppApi-OnRequest-52bc3c17_IamRole_CBB68D47: Refreshing state... [id=terraform-20230808003212924500000001]
data.aws_region.Region: Read complete after 0s [id=us-east-1]
aws_dynamodb_table.VotingAppStore_Entries_tfawsdynamodbTableDynamodbTable_76D1C895: Refreshing state... [id=Entries-e91f54ab]
aws_s3_bucket.Code: Refreshing state... [id=code-c84a50b1-20230727202411678600000003]
aws_iam_role.InitializeTable_Function_IamRole_E3F0843D: Refreshing state... [id=terraform-20230727202411672600000001]
aws_cloudfront_origin_access_control.cloudWebsite_CloudfrontOac_C956968B: Refreshing state... [id=E1J2GO7P2VQ2EZ]
aws_iam_role_policy.InitializeTable_Function_IamRolePolicy_2AD89519: Refreshing state... [id=terraform-20230727202411672600000001:terraform-20230727202424567600000008]
aws_iam_role_policy_attachment.InitializeTable_Function_IamRolePolicyAttachment_4435DE19: Refreshing state... [id=terraform-20230727202411672600000001-20230727202411887400000005]
aws_iam_role_policy.VotingAppApi_VotingAppApi-OnRequest-52bc3c17_IamRolePolicy_0F307DC9: Refreshing state... [id=terraform-20230808003212924500000001:terraform-20230808003225755300000003]
aws_iam_role_policy_attachment.VotingAppApi_VotingAppApi-OnRequest-52bc3c17_IamRolePolicyAttachment_92A90320: Refreshing state... [id=terraform-20230808003212924500000001-20230808003213158800000002]
aws_iam_role_policy_attachment.VotingAppApi_VotingAppApi-OnRequest-41f14472_IamRolePolicyAttachment_E1980EB1: Refreshing state... [id=terraform-20230727204725916100000001-20230727204726450200000003]
aws_iam_role_policy.VotingAppApi_VotingAppApi-OnRequest-41f14472_IamRolePolicy_25C9720E: Refreshing state... [id=terraform-20230727204725916100000001:terraform-20230727204739773400000005]
aws_iam_role_policy.VotingAppApi_VotingAppApi-OnRequest-8d2e75ec_IamRolePolicy_2D34FA97: Refreshing state... [id=terraform-20230803215115569800000002:terraform-20230803215115813700000003]
aws_iam_role_policy_attachment.VotingAppApi_VotingAppApi-OnRequest-8d2e75ec_IamRolePolicyAttachment_055C2EDA: Refreshing state... [id=terraform-20230803215115569800000002-20230803215115890800000004]
aws_s3_object.InitializeTable_Function_S3Object_F5933D3B: Refreshing state... [id=asset.c8e7055bb3773d297f63b5172fb6a571cddc069012.209870541a501efe90681723f43c8bdf.zip]
aws_s3_object.VotingAppApi_VotingAppApi-OnRequest-52bc3c17_S3Object_F3A42DC6: Refreshing state... [id=asset.c89daf14978fb4fcb47ef703ae9610992b519c2727.4738965ed0598f9d124167016fdd88d6.zip]
aws_s3_object.VotingAppApi_VotingAppApi-OnRequest-41f14472_S3Object_C95F6BA9: Refreshing state... [id=asset.c87bddf927b70f22f963a14d64ce5f4bf1372d398a.f196f3aeaa50ee6087afae1ef72f9d16.zip]
aws_s3_object.VotingAppApi_VotingAppApi-OnRequest-8d2e75ec_S3Object_F8CCE004: Refreshing state... [id=asset.c8cf8e09741b572c80a663f9c8cf9ce40395e87b08.5537e71b71d83302f229d41220f2c6e8.zip]
aws_s3_bucket_server_side_encryption_configuration.cloudWebsite_Encryption_6A8A4E29: Refreshing state... [id=cloud-website-c8e58765-20230803215115368500000001]
aws_s3_bucket_website_configuration.cloudWebsite_BucketWebsiteConfiguration_920E8E41: Refreshing state... [id=cloud-website-c8e58765-20230803215115368500000001]
aws_s3_object.cloudWebsite_File--logo192png_6E513B20: Refreshing state... [id=/logo192.png]
aws_s3_object.cloudWebsite_File--manifestjson_5AC33197: Refreshing state... [id=/manifest.json]
aws_s3_object.cloudWebsite_File--static--css--main3451cd13cssmap_B24EB286: Refreshing state... [id=/static/css/main.3451cd13.css.map]
aws_s3_object.cloudWebsite_File--faviconico_A86052F9: Refreshing state... [id=/favicon.ico]
aws_s3_object.cloudWebsite_File--static--css--main3451cd13css_A369CB42: Refreshing state... [id=/static/css/main.3451cd13.css]
aws_s3_object.cloudWebsite_File--static--js--maind6e3e6d5jsmap_77378C0F: Refreshing state... [id=/static/js/main.d6e3e6d5.js.map]
aws_s3_object.cloudWebsite_File--static--js--78728cb0dcdchunkjsmap_F5D0643F: Refreshing state... [id=/static/js/787.28cb0dcd.chunk.js.map]
aws_s3_bucket_public_access_block.cloudWebsite_PublicAccessBlock_18A70311: Refreshing state... [id=cloud-website-c8e58765-20230803215115368500000001]
aws_cloudfront_distribution.cloudWebsite_Distribution_083B5AF9: Refreshing state... [id=E1QUV69RQ9ODON]
aws_s3_object.cloudWebsite_File--indexhtml_2A2AE13C: Refreshing state... [id=/index.html]
aws_s3_object.cloudWebsite_File--static--js--maind6e3e6d5js_5D305F3F: Refreshing state... [id=/static/js/main.d6e3e6d5.js]
aws_s3_object.cloudWebsite_File--static--js--maind6e3e6d5jsLICENSEtxt_5FEACFB4: Refreshing state... [id=/static/js/main.d6e3e6d5.js.LICENSE.txt]
aws_s3_object.cloudWebsite_File--asset-manifestjson_8187FE70: Refreshing state... [id=/asset-manifest.json]
aws_s3_object.cloudWebsite_File--logo512png_E26C5AA3: Refreshing state... [id=/logo512.png]
aws_s3_object.cloudWebsite_File--robotstxt_F93900E9: Refreshing state... [id=/robots.txt]
aws_s3_object.cloudWebsite_File--static--js--78728cb0dcdchunkjs_40889769: Refreshing state... [id=/static/js/787.28cb0dcd.chunk.js]
aws_lambda_function.InitializeTable_Function_FD00736D: Refreshing state... [id=Function-c8e7055b]
aws_lambda_function.VotingAppApi_VotingAppApi-OnRequest-52bc3c17_02CD08E6: Refreshing state... [id=VotingAppApi-OnRequest-52bc3c17-c89daf14]
aws_lambda_function.VotingAppApi_VotingAppApi-OnRequest-41f14472_39478289: Refreshing state... [id=VotingAppApi-OnRequest-41f14472-c87bddf9]
aws_lambda_function.VotingAppApi_VotingAppApi-OnRequest-8d2e75ec_93510F52: Refreshing state... [id=VotingAppApi-OnRequest-8d2e75ec-c8cf8e09]
data.aws_iam_policy_document.cloudWebsite_AllowDistributionReadOnly_89DC4FD0: Reading...
data.aws_iam_policy_document.cloudWebsite_AllowDistributionReadOnly_89DC4FD0: Read complete after 0s [id=573591717]
aws_s3_bucket_policy.cloudWebsite_DistributionS3BucketPolicy_32B029AE: Refreshing state... [id=cloud-website-c8e58765-20230803215115368500000001]
aws_api_gateway_rest_api.VotingAppApi_api_CB41EC98: Refreshing state... [id=dfh6uhtoa0]
aws_api_gateway_deployment.VotingAppApi_api_deployment_B9647894: Refreshing state... [id=333m0r]
aws_lambda_permission.VotingAppApi_api_permission-GET-5969f3af_56B4A504: Refreshing state... [id=AllowExecutionFromAPIGateway-GET-5969f3af]
aws_lambda_permission.VotingAppApi_api_permission-POST-53dc1f64_98751060: Refreshing state... [id=AllowExecutionFromAPIGateway-POST-53dc1f64]
aws_lambda_permission.VotingAppApi_api_permission-POST-57590acc_3E83C8F6: Refreshing state... [id=AllowExecutionFromAPIGateway-POST-57590acc]
aws_api_gateway_stage.VotingAppApi_api_stage_9B2FA9EA: Refreshing state... [id=ags-dfh6uhtoa0-prod]
aws_s3_object.cloudWebsite_File-configjson_591A81BA: Refreshing state... [id=config.json]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_lambda_invocation.InitializeTable_Invocation_6E01246F will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_lambda_invocation" "InitializeTable_Invocation_6E01246F" {
      + function_name = "Function-c8e7055b"
      + id            = (known after apply)
      + input         = jsonencode({})
      + result        = (known after apply)
    }

  # aws_api_gateway_deployment.VotingAppApi_api_deployment_B9647894 must be replaced
+/- resource "aws_api_gateway_deployment" "VotingAppApi_api_deployment_B9647894" {
      ~ created_date  = "2023-08-11T01:27:25Z" -> (known after apply)
      ~ execution_arn = "arn:aws:execute-api:us-east-1:223316951128:dfh6uhtoa0/" -> (known after apply)
      ~ id            = "333m0r" -> (known after apply)
      ~ invoke_url    = "https://dfh6uhtoa0.execute-api.us-east-1.amazonaws.com/" -> (known after apply)
      ~ triggers      = { # forces replacement
          ~ "redeployment" = "67e900f09073a98ba58bf20f7ef29d4afc0a3c54" -> "2af98f3563769ccd0147ff1b0e990c17b84e35ff"
        }
        # (1 unchanged attribute hidden)
    }

  # aws_api_gateway_stage.VotingAppApi_api_stage_9B2FA9EA will be updated in-place
  ~ resource "aws_api_gateway_stage" "VotingAppApi_api_stage_9B2FA9EA" {
      ~ deployment_id         = "333m0r" -> (known after apply)
        id                    = "ags-dfh6uhtoa0-prod"
        tags                  = {}
        # (9 unchanged attributes hidden)
    }

  # aws_iam_role_policy.VotingAppApi_VotingAppApi-OnRequest-41f14472_IamRolePolicy_25C9720E will be updated in-place
  ~ resource "aws_iam_role_policy" "VotingAppApi_VotingAppApi-OnRequest-41f14472_IamRolePolicy_25C9720E" {
        id     = "terraform-20230727204725916100000001:terraform-20230727204739773400000005"
        name   = "terraform-20230727204739773400000005"
      ~ policy = jsonencode(
          ~ {
              ~ Statement = [
                    {
                        Action   = [
                            "dynamodb:PutItem",
                        ]
                        Effect   = "Allow"
                        Resource = [
                            "arn:aws:dynamodb:us-east-1:223316951128:table/Entries-e91f54ab",
                        ]
                    },
                  + {
                      + Action   = [
                          + "dynamodb:GetItem",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:dynamodb:us-east-1:223316951128:table/Entries-e91f54ab",
                        ]
                    },
                    {
                        Action   = [
                            "dynamodb:Scan",
                        ]
                        Effect   = "Allow"
                        Resource = [
                            "arn:aws:dynamodb:us-east-1:223316951128:table/Entries-e91f54ab",
                        ]
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        # (1 unchanged attribute hidden)
    }

  # aws_lambda_function.InitializeTable_Function_FD00736D will be updated in-place
  ~ resource "aws_lambda_function" "InitializeTable_Function_FD00736D" {
        id                             = "Function-c8e7055b"
      ~ last_modified                  = "2023-08-11T01:27:25.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:223316951128:function:Function-c8e7055b:9" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:223316951128:function:Function-c8e7055b:9/invocations" -> (known after apply)
      ~ s3_key                         = "asset.c8e7055bb3773d297f63b5172fb6a571cddc069012.209870541a501efe90681723f43c8bdf.zip" -> "asset.c8e7055bb3773d297f63b5172fb6a571cddc069012.9e969cd1303f4f370ff0fb50948e33dd.zip"
        tags                           = {}
      ~ version                        = "9" -> (known after apply)
        # (18 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.VotingAppApi_VotingAppApi-OnRequest-41f14472_39478289 will be updated in-place
  ~ resource "aws_lambda_function" "VotingAppApi_VotingAppApi-OnRequest-41f14472_39478289" {
        id                             = "VotingAppApi-OnRequest-41f14472-c87bddf9"
      ~ last_modified                  = "2023-08-11T01:27:25.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:223316951128:function:VotingAppApi-OnRequest-41f14472-c87bddf9:8" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:223316951128:function:VotingAppApi-OnRequest-41f14472-c87bddf9:8/invocations" -> (known after apply)
      ~ s3_key                         = "asset.c87bddf927b70f22f963a14d64ce5f4bf1372d398a.f196f3aeaa50ee6087afae1ef72f9d16.zip" -> "asset.c87bddf927b70f22f963a14d64ce5f4bf1372d398a.b0b1eb46061e86119775e96130f76a26.zip"
        tags                           = {}
      ~ version                        = "8" -> (known after apply)
        # (18 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.VotingAppApi_VotingAppApi-OnRequest-52bc3c17_02CD08E6 will be updated in-place
  ~ resource "aws_lambda_function" "VotingAppApi_VotingAppApi-OnRequest-52bc3c17_02CD08E6" {
        id                             = "VotingAppApi-OnRequest-52bc3c17-c89daf14"
      ~ last_modified                  = "2023-08-11T01:27:25.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:223316951128:function:VotingAppApi-OnRequest-52bc3c17-c89daf14:5" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:223316951128:function:VotingAppApi-OnRequest-52bc3c17-c89daf14:5/invocations" -> (known after apply)
      ~ s3_key                         = "asset.c89daf14978fb4fcb47ef703ae9610992b519c2727.4738965ed0598f9d124167016fdd88d6.zip" -> "asset.c89daf14978fb4fcb47ef703ae9610992b519c2727.fed500fa6a381cd967699d5f76a03846.zip"
        tags                           = {}
      ~ version                        = "5" -> (known after apply)
        # (18 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.VotingAppApi_VotingAppApi-OnRequest-8d2e75ec_93510F52 will be updated in-place
  ~ resource "aws_lambda_function" "VotingAppApi_VotingAppApi-OnRequest-8d2e75ec_93510F52" {
        id                             = "VotingAppApi-OnRequest-8d2e75ec-c8cf8e09"
      ~ last_modified                  = "2023-08-11T01:27:25.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:223316951128:function:VotingAppApi-OnRequest-8d2e75ec-c8cf8e09:7" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:223316951128:function:VotingAppApi-OnRequest-8d2e75ec-c8cf8e09:7/invocations" -> (known after apply)
      ~ s3_key                         = "asset.c8cf8e09741b572c80a663f9c8cf9ce40395e87b08.5537e71b71d83302f229d41220f2c6e8.zip" -> "asset.c8cf8e09741b572c80a663f9c8cf9ce40395e87b08.e2d0778e1abf621f9fab6461eb60be75.zip"
        tags                           = {}
      ~ version                        = "7" -> (known after apply)
        # (18 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_s3_object.InitializeTable_Function_S3Object_F5933D3B must be replaced
-/+ resource "aws_s3_object" "InitializeTable_Function_S3Object_F5933D3B" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "69fef6c3089a09300ba9a4ac1e8a1563" -> (known after apply)
      ~ id                     = "asset.c8e7055bb3773d297f63b5172fb6a571cddc069012.209870541a501efe90681723f43c8bdf.zip" -> (known after apply)
      ~ key                    = "asset.c8e7055bb3773d297f63b5172fb6a571cddc069012.209870541a501efe90681723f43c8bdf.zip" -> "asset.c8e7055bb3773d297f63b5172fb6a571cddc069012.9e969cd1303f4f370ff0fb50948e33dd.zip" # forces replacement
      + kms_key_id             = (known after apply)
      - metadata               = {} -> null
      ~ server_side_encryption = "AES256" -> (known after apply)
      ~ source                 = "assets/InitializeTable_Function_Asset_1A1B5BC3/209870541A501EFE90681723F43C8BDF/archive.zip" -> "assets/InitializeTable_Function_Asset_1A1B5BC3/9E969CD1303F4F370FF0FB50948E33DD/archive.zip"
      ~ storage_class          = "STANDARD" -> (known after apply)
      - tags                   = {} -> null
      ~ tags_all               = {} -> (known after apply)
      + version_id             = (known after apply)
        # (3 unchanged attributes hidden)
    }

  # aws_s3_object.VotingAppApi_VotingAppApi-OnRequest-41f14472_S3Object_C95F6BA9 must be replaced
+/- resource "aws_s3_object" "VotingAppApi_VotingAppApi-OnRequest-41f14472_S3Object_C95F6BA9" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "52bfd89578cb526048c0b3127103b825" -> (known after apply)
      ~ id                     = "asset.c87bddf927b70f22f963a14d64ce5f4bf1372d398a.f196f3aeaa50ee6087afae1ef72f9d16.zip" -> (known after apply)
      ~ key                    = "asset.c87bddf927b70f22f963a14d64ce5f4bf1372d398a.f196f3aeaa50ee6087afae1ef72f9d16.zip" -> "asset.c87bddf927b70f22f963a14d64ce5f4bf1372d398a.b0b1eb46061e86119775e96130f76a26.zip" # forces replacement
      + kms_key_id             = (known after apply)
      - metadata               = {} -> null
      ~ server_side_encryption = "AES256" -> (known after apply)
      ~ source                 = "assets/VotingAppApi_VotingAppApi-OnRequest-41f14472_Asset_94F55D63/F196F3AEAA50EE6087AFAE1EF72F9D16/archive.zip" -> "assets/VotingAppApi_VotingAppApi-OnRequest-41f14472_Asset_94F55D63/B0B1EB46061E86119775E96130F76A26/archive.zip"
      ~ storage_class          = "STANDARD" -> (known after apply)
      - tags                   = {} -> null
      ~ tags_all               = {} -> (known after apply)
      + version_id             = (known after apply)
        # (3 unchanged attributes hidden)
    }

  # aws_s3_object.VotingAppApi_VotingAppApi-OnRequest-52bc3c17_S3Object_F3A42DC6 must be replaced
+/- resource "aws_s3_object" "VotingAppApi_VotingAppApi-OnRequest-52bc3c17_S3Object_F3A42DC6" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "5be26ece65a75b91bcc0a70728633923" -> (known after apply)
      ~ id                     = "asset.c89daf14978fb4fcb47ef703ae9610992b519c2727.4738965ed0598f9d124167016fdd88d6.zip" -> (known after apply)
      ~ key                    = "asset.c89daf14978fb4fcb47ef703ae9610992b519c2727.4738965ed0598f9d124167016fdd88d6.zip" -> "asset.c89daf14978fb4fcb47ef703ae9610992b519c2727.fed500fa6a381cd967699d5f76a03846.zip" # forces replacement
      + kms_key_id             = (known after apply)
      - metadata               = {} -> null
      ~ server_side_encryption = "AES256" -> (known after apply)
      ~ source                 = "assets/VotingAppApi_VotingAppApi-OnRequest-52bc3c17_Asset_FBAD96D6/4738965ED0598F9D124167016FDD88D6/archive.zip" -> "assets/VotingAppApi_VotingAppApi-OnRequest-52bc3c17_Asset_FBAD96D6/FED500FA6A381CD967699D5F76A03846/archive.zip"
      ~ storage_class          = "STANDARD" -> (known after apply)
      - tags                   = {} -> null
      ~ tags_all               = {} -> (known after apply)
      + version_id             = (known after apply)
        # (3 unchanged attributes hidden)
    }

  # aws_s3_object.VotingAppApi_VotingAppApi-OnRequest-8d2e75ec_S3Object_F8CCE004 must be replaced
+/- resource "aws_s3_object" "VotingAppApi_VotingAppApi-OnRequest-8d2e75ec_S3Object_F8CCE004" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "b7fccc4d8bd16c913b5185c500bf315b" -> (known after apply)
      ~ id                     = "asset.c8cf8e09741b572c80a663f9c8cf9ce40395e87b08.5537e71b71d83302f229d41220f2c6e8.zip" -> (known after apply)
      ~ key                    = "asset.c8cf8e09741b572c80a663f9c8cf9ce40395e87b08.5537e71b71d83302f229d41220f2c6e8.zip" -> "asset.c8cf8e09741b572c80a663f9c8cf9ce40395e87b08.e2d0778e1abf621f9fab6461eb60be75.zip" # forces replacement
      + kms_key_id             = (known after apply)
      - metadata               = {} -> null
      ~ server_side_encryption = "AES256" -> (known after apply)
      ~ source                 = "assets/VotingAppApi_VotingAppApi-OnRequest-8d2e75ec_Asset_4A29FD21/5537E71B71D83302F229D41220F2C6E8/archive.zip" -> "assets/VotingAppApi_VotingAppApi-OnRequest-8d2e75ec_Asset_4A29FD21/E2D0778E1ABF621F9FAB6461EB60BE75/archive.zip"
      ~ storage_class          = "STANDARD" -> (known after apply)
      - tags                   = {} -> null
      ~ tags_all               = {} -> (known after apply)
      + version_id             = (known after apply)
        # (3 unchanged attributes hidden)
    }

Plan: 5 to add, 6 to change, 5 to destroy.

```

</details>
